public_html/hw4.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hw4</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="hw4"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-23 22:24:24 CDT"/>
<meta name="author" content="Neil Best"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">hw4</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 CSPP 53001: Assignment 4</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Online homework and project due by 11:59pm on Wednesday, November 7, 2012</a></li>
<li><a href="#sec-1-2">1.2 Step 3 of Your TBP</a></li>
<li><a href="#sec-1-3">1.3 Problem Set</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CSPP 53001: Assignment 4</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Online homework and project due by 11:59pm on Wednesday, November 7, 2012</h4>
<div class="outline-text-4" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> Step 3 of Your TBP</h4>
<div class="outline-text-4" id="text-1-2">


<p>
The third part of the TBP project is to design and run some interesting
queries involving joins and aggregation. Please, choose your queries
carefully and add comments that describe the purpose of each query. Your
queries should correspond to actions or functionality that your TBP app
may implement. For example, you may want to find all users that follow
at least one twitterer that you follow.
</p>
<ol>
<li>Develop and test at least eight SQL queries involving joins. Please,
   generate a script file called <code>joins3.sql</code> with all of your queries.
</li>
<li>Develop and test at least eight SQL queries involving aggregation.
   Please, generate a script file called <code>aggrs3.sql</code> with all of your
   queries.
   When you write the join and aggregation queries, consider the
   functionality of your TBP app. Try to write queries that will be
   useful in implementing some features of your TBP app. For example,
   displaying the tweets of all of the users someone follows will
   involve a join while listing the number of followers for any user
   will be an aggregation query.
</li>
<li>Develop and test at least two each of the four types of SQL data
   modification commands: <code>insert</code> a single tuple, <code>insert</code> a subquery,
   <code>delete</code>, <code>update</code>. Please, generate a script file called <code>mods3.sql</code>
   with all of your modifications.
</li>
</ol>


<p>
You will submit your homework using the <code>hwsubmit</code> command. Please,
create a new directory called hw3_&lt;your_username&gt;, e.g. hw3_evtimov,
and move all of the relevant scripts and data files there. Then, you can
submit your work by typing (&lt;path_to&gt; is the directory path to your hw3
directory).
</p>
<p>
<code>hwsubmit cspp53001 &lt;path_to&gt;/hw3_&lt;your_username&gt;</code>
</p>
<p>
<b>Please make sure that all of the relevant files and no others are in that directory.</b>
</p>

<hr/>


<hr/>

</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3"><span class="section-number-4">1.3</span> Problem Set</h4>
<div class="outline-text-4" id="text-1-3">


<p>
You will complete the problem set using
<a href="http://www.newgradiance.com/">Gradiance</a>
(<a href="http://www.newgradiance.com/">http://www.newgradiance.com/</a>).
</p>
<p>
The name of the homework is CSPPDB-Aut12 HW4. There are 11 questions in
this homework - 10 regular questions and one extra credit one (about
outer joins). All questions in this problem set are multiple choice.
However, to answer them correctly you will need to work out their long
(general) answers. A correct answer is worth 3 points. You lose a point
for each incorrect answer. You can attempt the problem set as many times
as you like; only your highest score will count. You do not have to
solve the challenge question to receive full credit but if you get it
wrong you will lose a point. Note that you will probably get slightly
different questions each time you attempt the problem set.
</p>
<p>
<b>The due date for the Gradiance part of the homework is 11:59pm on Wednesday, November 7, 2012.</b>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-23 22:24:24 CDT</p>
<p class="author">Author: Neil Best</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
